const test = `대부분의 언어에서 문자열은 불변(Immutable)입니다. 변하지 않는다고 하면 이해하기 어려워하는 사람들이 있을텐데. 정확하게 말하면 문자열을 수정할 때, 새로운 문자열을 복사해서 만든다는 이야기다. 이걸 Copy on Write 라고도 한다. 파이썬에서 가변(mutable)한 자료형인 List와 비교해서 알아보자.`;
function stemmer(word) {

  return [
    word
    .replace(/페이지/, 'page')

    .replace(/도메인/, 'domain')
      .replace(/긴/, '기다')
      .replace(/(니면서|닙니다)/, '')
      .replace(/(리면|리고)/, '리다')
      .replace(
        /(하면서|하질|왔던|였는데요|었고요|였기|면서|힐텐데|히다|하고|하다가|하는|고|곤)$/,
        ''
      )
      .replace(
        /(한데|들조차|들에다|들이었죠|들입니다|이라|라던가|했는데|려서|해서|합니다|하고|하는|하던데요|해|였다)$/,
        ''
      )
      .replace(/집니다/, '지')
      .replace(
        /(시키는데|해보이실|되었습니다|이었습니다|입니다|하는데|거든요|인|와|한다|인데요|들은|에서|된|랑|만|과|할|한|들|들만|이니|이고|이라고|이|가|을|를|은|는|의|으로|됩니다|에도|도|에|로|겠습니다|합니다|라고)$/,
        ''
      )
      
      .replace(/주시는데$/, '주다')
      .replace(/갔는데$/, '가다')
      .replace(/(했는데요|하는데요|는데요|셨는데요|셨는데|보는데|받는데|오는데|는데)$/, '')
      .replace(/(보자)$/, '보다')
      .replace(/와서요/, '오다')
      .replace(/갔다/, '가다')
      .replace(/거웠다/, '거운')
      .replace(/옵니다/, '오다')
      .replace(/(해나가다|했다|었다|하셨다|주셨다|주셨)$/, '하다')

      .replace(/(겠다|어왔다다|어줍시다|어줍니다|었지|어보면|어보다가|어놓는다|어봅시다|어보세요|어보다|었으니|었는지|어둔|다보니|자|거나|었는데|어주|어보|어서|어|어보지|자니|어요|던|어서|어야|어놨다|어봤다|어왔다|었다|어냅니다|어진|어낼|었는데요|었어요|어줍니다|어놨다|으신|시면|습니다|게|면)$/, '다')
      .replace(/(거든요|놓고|셨죠|십니다|이고요|실지|겠죠|다다|으신|시면|습니다|게|기|려다|어야한다|어요|거든요|죠)$/, '다')
      .replace(/(립니다|려서|렷다)$/, '리다')
      .replace(/(해왔는지|해주셨다|주셨어요|주셨거든요|주셨죠|아보려는데|으니까요|아서|아볼|아봤다|아야해요|아보세요|보다보다|려는데|본다|아보시|아봐)$/, '다')
      .replace(/줬다/, '주다')
      .replace(/쳤다$/, '치다')
      .replace(/(보려)$/, '보다')
      .replace(/(까지|이지|봅시다|해봅시다)/, '')
      .replace(/(학다)/, '학자')
      .replace(/(했|하|처럼|있는지|이었다|이나|보다|해나가다|하셨다|해볼게요|였다|시키|부터|라다|라서|되지|되다|되|에다|에서|시킵니다|리셨을지|랐다|려보세요|리지|리다|리셨|리|스러웠지|하지|했다|에요|에서|에|하냐|하다|들|하고다|해보다|했었죠|어봤다)$/, '')
      .replace(/뷰다/, '뷰어')
      .trim(),
  ]
}

function splitKorean(str) {
  return str
    .replace(/[\n?'",.!()\[\]<>]/g, ' ')
    .split(' ')
    .flatMap(stemmer)
    .filter((s) => s !== '')
}
module.exports = splitKorean;
